Repository: AliakseiYafremau/fit-app
Catalog: lib/l10n/app_*.arb
Languages: ru

# tabWorkouts
source: Workouts
ru: Тренировки

# tabExercises
source: Exercises
ru: Упражнения

# searchHint
source: Search
ru: Поиск

# historyButton
source: History
ru: История

# calendarButton
source: Calendar
ru: Календарь

# dashboardCategories
source: Categories
ru: Категории

# historyViewList
source: List
ru: Список

# historyViewCalendar
source: Calendar
ru: Календарь

# noWorkouts
source: No workouts yet
ru: Тренировок пока нет

# noExercises
source: No exercises yet
ru: Упражнений пока нет

# sessionHistoryTitle
source: Session history
ru: История сессий

# sessionHistoryEmpty
source: No completed sessions yet
ru: Завершённых сессий пока нет

# sessionCalendarTitle
source: Session calendar
ru: Календарь сессий

# sessionCalendarEmpty
source: No completed sessions yet
ru: Завершённых сессий пока нет

# sessionsOnDay
source: Sessions on {date}
ru: Сессии на {date}

# sessionDayEmpty
source: No sessions on this day
ru: В этот день сессий не было

# startedLabel
source: Started {date}
ru: Начало {date}

# finishedLabel
source: Finished {date}
ru: Окончание {date}

# languageSelectorTooltip
source: Language
ru: Язык

# languageEnglish
source: English
ru: Английский

# languageRussian
source: Russian
ru: Русский

# fabActiveSessionTooltip
source: View active session
ru: Активная сессия

# deleteExerciseTitle
source: Delete exercise
ru: Удалить упражнение

# deleteExerciseMessage
source: Are you sure you want to delete "{name}"?
ru: Удалить упражнение «{name}»?

# deleteWorkoutTitle
source: Delete workout
ru: Удалить тренировку

# deleteWorkoutMessage
source: Delete workout "{name}"?
ru: Удалить тренировку «{name}»?

# cancelSessionTitle
source: Cancel session
ru: Отменить сессию

# cancelSessionMessage
source: Are you sure you want to cancel this session? Progress will be lost.
ru: Точно отменить сессию? Прогресс будет потерян.

# cancelSessionKeep
source: Keep session
ru: Оставить

# cancelSessionConfirm
source: Cancel session
ru: Отменить сессию

# buttonCancel
source: Cancel
ru: Отмена

# buttonDelete
source: Delete
ru: Удалить

# buttonSave
source: Save
ru: Сохранить

# buttonClose
source: Close
ru: Закрыть

# buttonStartSession
source: Start session
ru: Начать сессию

# buttonEditWorkout
source: Edit workout
ru: Изменить

# buttonDeleteWorkout
source: Delete workout
ru: Удалить

# buttonEditExercise
source: Edit exercise
ru: Изменить

# buttonDeleteExercise
source: Delete exercise
ru: Удалить

# buttonUndo
source: Undo
ru: Отменить

# buttonFinishSession
source: Finish session
ru: Завершить сессию

# buttonCancelSession
source: Cancel session
ru: Отменить сессию

# noPlannedSets
source: No planned sets for this training
ru: У этой тренировки нет планов

# errorUnableToOpenLink
source: Unable to open link
ru: Не удалось открыть ссылку

# errorUnableToLoadPhoto
source: Unable to load photo
ru: Не удалось загрузить фото

# sessionSummaryEmpty
source: No sets were tracked in this session
ru: В этой сессии не отслеживались подходы

# sessionSummaryTitle
source: Completed session summary
ru: Итоги сессии

# completeSetTitle
source: Complete set
ru: Завершение подхода

# errorEnterValidRepetitions
source: Enter valid repetitions
ru: Введите корректное количество повторений

# errorEnterValidWeight
source: Enter valid weight
ru: Введите корректный вес

# errorWeightRequired
source: Weight required for this exercise
ru: Для этого упражнения нужен вес

# emptySessionSets
source: No sets in this session
ru: В этой сессии нет подходов

# errorFinishSession
source: Unable to finish session
ru: Не удалось завершить сессию

# errorCancelSession
source: Unable to cancel session
ru: Не удалось отменить сессию

# errorCompleteSet
source: Unable to complete set
ru: Не удалось завершить подход

# errorUndoSet
source: Unable to undo set
ru: Не удалось отменить подход

# labelRepetitions
source: Repetitions
ru: Повторения

# labelWeight
source: Weight
ru: Вес

# helperWeightedExercise
source: Required for weighted exercises
ru: Нужно для упражнений с весом

# bodyweightOnly
source: This exercise is bodyweight only
ru: Это упражнение только с собственным весом

# sessionSheetTitle
source: Session
ru: Сессия

# categoriesSheetTitle
source: Categories
ru: Категории

# categoriesEmpty
source: No categories yet
ru: Категорий пока нет

# categoryFormTitle
source: Create category
ru: Создать категорию

# categoryNameLabel
source: Category name
ru: Название категории

# categoryColorLabel
source: Color
ru: Цвет

# categoryCreateButton
source: Create category
ru: Создать

# categoryPickColorButton
source: Choose color
ru: Выбрать цвет

# categoryColorPickerTitle
source: Pick a color
ru: Выберите цвет

# messageCategoryCreated
source: Category created
ru: Категория создана

# categoryEditDialogTitle
source: Edit category
ru: Изменить категорию

# categoryActionEdit
source: Edit
ru: Изменить

# categoryDeleteDialogTitle
source: Delete category
ru: Удалить категорию

# categoryDeleteConfirmation
source: Delete "{name}"? This action cannot be undone.
ru: Удалить «{name}»? Это действие нельзя отменить.

# messageCategoryUpdated
source: Category updated
ru: Категория обновлена

# messageCategoryDeleted
source: Category deleted
ru: Категория удалена

# errorCategoryNameRequired
source: Enter category name
ru: Введите название категории

# errorCreateCategory
source: Unable to create category
ru: Не удалось создать категорию

# errorUpdateCategory
source: Unable to update category
ru: Не удалось обновить категорию

# errorDeleteCategory
source: Unable to delete category
ru: Не удалось удалить категорию

# sectionPhoto
source: Photo
ru: Фото

# sectionTechnique
source: Technique
ru: Техника

# sectionNotes
source: Notes
ru: Заметки

# sectionLinks
source: Links
ru: Ссылки

# exerciseFormCreateTitle
source: Create Exercise
ru: Создать упражнение

# exerciseFormEditTitle
source: Edit Exercise
ru: Изменить упражнение

# exerciseFormNameLabel
source: Exercise name
ru: Название упражнения

# errorExerciseNameRequired
source: Enter exercise name
ru: Введите название упражнения

# exerciseFormNoPhoto
source: No photo selected
ru: Фото не выбрано

# exerciseFormAddPhoto
source: Add photo
ru: Добавить фото

# exerciseFormChangePhoto
source: Change photo
ru: Сменить фото

# exerciseFormRemovePhoto
source: Remove photo
ru: Удалить фото

# exerciseFormTechniqueLabel
source: Technique description
ru: Описание техники

# exerciseFormNotesLabel
source: Notes
ru: Заметки

# exerciseFormCategoriesLabel
source: Categories
ru: Категории

# exerciseFormNoCategories
source: No categories yet
ru: Категорий пока нет

# exerciseFormLinkLabel
source: Link {index}
ru: Ссылка {index}

# exerciseFormAddLink
source: Add link
ru: Добавить ссылку

# exerciseFormAddExercise
source: Add exercise
ru: Добавить упражнение

# exerciseFormSaveChanges
source: Save changes
ru: Сохранить изменения

# exerciseUsesWeights
source: Uses weights
ru: С весами

# exerciseBodyweight
source: Bodyweight / no weights
ru: Без веса / собственный вес

# plannedSetsCount
source: {count, plural, one{{count} planned set} other{{count} planned sets}}
ru: {count, plural, one{{count} запланированный подход} few{{count} запланированных подхода} many{{count} запланированных подходов} other{{count} запланированных подходов}}

# completedSetsCount
source: {count, plural, one{{count} completed set} other{{count} completed sets}}
ru: {count, plural, one{{count} завершённый подход} few{{count} завершённых подхода} many{{count} завершённых подходов} other{{count} завершённых подходов}}

# buttonUpdate
source: Update
ru: Обновить

# buttonComplete
source: Complete
ru: Завершить

# repetitionsWithUnit
source: {count} reps
ru: {count} повт.

# errorEnterTrainingName
source: Enter training name
ru: Введите название тренировки

# errorFillSets
source: Fill all new sets with valid exercises and repetitions
ru: Заполните новые подходы корректными упражнениями и повторениями

# errorTrainingNeedsSet
source: Training must have at least one planned set
ru: В тренировке должен быть хотя бы один подход

# errorAddAtLeastOneSet
source: Add at least one set
ru: Добавьте хотя бы один подход

# editTrainingTitle
source: Edit Training
ru: Редактирование тренировки

# createTrainingTitle
source: Create Training
ru: Создание тренировки

# labelTrainingName
source: Training name
ru: Название тренировки

# existingSetsLabel
source: Existing sets
ru: Существующие подходы

# newSetsLabel
source: New sets
ru: Новые подходы

# setsLabel
source: Sets
ru: Подходы

# labelExercise
source: Exercise
ru: Упражнение

# actionKeep
source: Keep
ru: Оставить

# actionRemove
source: Remove
ru: Удалить

# buttonAddSet
source: Add set
ru: Добавить подход

# buttonAddNewSet
source: Add new set
ru: Добавить новый подход

# buttonSaveChanges
source: Save changes
ru: Сохранить изменения

# buttonAddTraining
source: Add
ru: Добавить
